{"Bangladeshi": {"Beef Samosas": {"Meta_Info": {"Prep Time:": "30 mins", "Cook Time:": "30 mins", "Additional Time:": " 1 hrs", "Total Time:": " 2 hrs", "Servings:": "18 ", "Yield:": "18 samosas"}, "Directions": {"1": "\nBring a medium saucepan of lightly salted water to a boil. Stir in potatoes and peas; cook until potatoes are tender but still firm, about 15 minutes. Drain, mash together, and set aside.\n", "2": "\nMeanwhile, heat 2 tablespoons oil in a large saucepan over medium-high heat. Add cumin seeds and bay leaf; stir until fragrant and seeds are browned. Add ground beef and onions; cook until beef is browned and crumbly and onions are soft, about 5 to 7 minutes.\n", "3": "\nStir in garlic and ginger. Season with salt, cumin, coriander, turmeric, chili powder, cinnamon, cardamom, and black pepper. Stir in the mashed potato mixture. Remove from heat and chill in the refrigerator for 1 hour, or until cool.\n", "4": "\nHeat 1 quart of oil in a deep saucepan over medium heat.\n", "5": "\nMix cilantro and green chile peppers into potato and beef mixture. Place approximately 1 tablespoon of the mixture onto each phyllo sheet. Fold sheets into triangles, pressing edges together with moistened fingers.\n", "6": "\nLower samosas carefully into the hot oil in batches. Fry until golden brown, about 3 minutes. Transfer to a paper towel-lined plate to drain. Repeat with remaining samosas. Serve warm.\n"}, "Nutrition": {"Fat": "15g ", "Carbs": "24g ", "Protein": "8g "}, "Ingredients": ["2__large__potatoes, peeled", "1__cup__frozen peas, thawed", "2__tablespoons__vegetable oil", "½__teaspoon__cumin seeds", "1____bay leaf, crushed", "1__pound__ground beef", "2__large__onions, finely chopped", "4__cloves__garlic, crushed", "1__tablespoon__minced fresh ginger root", "1 ½__teaspoons__salt", "1__teaspoon__ground cumin", "1__teaspoon__ground coriander", "1__teaspoon__ground turmeric", "1__teaspoon__chili powder", "½__teaspoon__ground cinnamon", "½__teaspoon__ground cardamom", "½__teaspoon__ground black pepper", "1__quart__oil for deep frying", "2__tablespoons__chopped fresh cilantro", "2__tablespoons__chopped green chile peppers", "1__(16 ounce) package__phyllo dough"]}}}